
## Plan Result




<pre><code>Plan: 14 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_cloudwatch_log_group.cbs_s3_satellite_bucket_rule
  * aws_config_config_rule.cbs_s3_bucket_logging_enabled
  * aws_config_config_rule.cbs_s3_satellite_bucket_rule
  * aws_config_remediation_configuration.cbs_s3_bucket_logging_enabled
  * aws_iam_policy.aws_config_policy
  * aws_iam_policy.s3_list_buckets
  * aws_iam_policy_attachment.aws-aws_config_policy-policy
  * aws_iam_policy_attachment.managed_policy
  * aws_iam_role.cbs_s3_satellite_bucket_rule
  * aws_iam_role.security_config
  * aws_iam_role_policy_attachment.cbs_s3_satellite_bucket_rule_basic_execution
  * aws_iam_role_policy_attachment.cbs_s3_satellite_bucket_rule_s3_list_buckets
  * aws_lambda_function.cbs_s3_satellite_bucket_rule
  * aws_lambda_permission.cbs_s3_satellite_bucket_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_log_group.cbs_s3_satellite_bucket_rule will be created
  + resource "aws_cloudwatch_log_group" "cbs_s3_satellite_bucket_rule" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/cbs_s3_satellite_bucket_rule"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
    }

  # aws_config_config_rule.cbs_s3_bucket_logging_enabled will be created
  + resource "aws_config_config_rule" "cbs_s3_bucket_logging_enabled" {
      + arn              = (known after apply)
      + description      = "A Config rule that checks whether logging to the cbs satellite is enabled for your S3 buckets."
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + targetBucket = "cbs-central-satellite-028051698106"
            }
        )
      + name             = "cbs_s3_bucket_logging_enabled"
      + rule_id          = (known after apply)
      + tags_all         = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::S3::Bucket",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "S3_BUCKET_LOGGING_ENABLED"
        }
    }

  # aws_config_config_rule.cbs_s3_satellite_bucket_rule will be created
  + resource "aws_config_config_rule" "cbs_s3_satellite_bucket_rule" {
      + arn              = (known after apply)
      + description      = "Checks that the CBS satellite bucket exists in the account."
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + satelliteBucket = "cbs-central-satellite-028051698106"
            }
        )
      + name             = "cbs_s3_satellite_bucket_rule"
      + rule_id          = (known after apply)
      + tags_all         = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::S3::Bucket",
            ]
        }

      + source {
          + owner             = "CUSTOM_LAMBDA"
          + source_identifier = (known after apply)

          + source_detail {
              + event_source                = "aws.config"
              + maximum_execution_frequency = "TwentyFour_Hours"
              + message_type                = "ScheduledNotification"
            }
        }
    }

  # aws_config_remediation_configuration.cbs_s3_bucket_logging_enabled will be created
  + resource "aws_config_remediation_configuration" "cbs_s3_bucket_logging_enabled" {
      + arn                        = (known after apply)
      + automatic                  = true
      + config_rule_name           = "cbs_s3_bucket_logging_enabled"
      + id                         = (known after apply)
      + maximum_automatic_attempts = 10
      + resource_type              = "AWS::S3::Bucket"
      + retry_attempt_seconds      = 3600
      + target_id                  = "AWS-ConfigureS3BucketLogging"
      + target_type                = "SSM_DOCUMENT"
      + target_version             = "1"

      + execution_controls {
          + ssm_controls {
              + concurrent_execution_rate_percentage = 25
              + error_percentage                     = 20
            }
        }

      + parameter {
          + name         = "AutomationAssumeRole"
          + static_value = (known after apply)
        }
      + parameter {
          + name           = "BucketName"
          + resource_value = "RESOURCE_ID"
        }
      + parameter {
          + name         = "GrantedPermission"
          + static_value = "FULL_CONTROL"
        }
      + parameter {
          + name         = "GranteeType"
          + static_value = "Group"
        }
      + parameter {
          + name         = "GranteeUri"
          + static_value = "http://acs.amazonaws.com/groups/s3/LogDelivery"
        }
      + parameter {
          + name         = "SSEAlgorithm"
          + static_value = "AES256"
        }
      + parameter {
          + name         = "TargetBucket"
          + static_value = "cbs-central-satellite-028051698106"
        }
    }

  # aws_iam_policy.aws_config_policy will be created
  + resource "aws_iam_policy" "aws_config_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "aws_config_policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutBucketLogging",
                          + "s3:GetReplicationConfiguration",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.s3_list_buckets will be created
  + resource "aws_iam_policy" "s3_list_buckets" {
      + arn         = (known after apply)
      + description = "IAM policy for listing all S3 buckets"
      + id          = (known after apply)
      + name        = "s3_list_buckets"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListAllMyBuckets"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy_attachment.aws-aws_config_policy-policy will be created
  + resource "aws_iam_policy_attachment" "aws-aws_config_policy-policy" {
      + id         = (known after apply)
      + name       = "aws_config_policy"
      + policy_arn = (known after apply)
      + roles      = [
          + "security_config",
        ]
    }

  # aws_iam_policy_attachment.managed_policy will be created
  + resource "aws_iam_policy_attachment" "managed_policy" {
      + id         = (known after apply)
      + name       = "aws_config_managed_policy"
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSConfigRole"
      + roles      = [
          + "cbs_s3_satellite_bucket_rule",
          + "security_config",
        ]
    }

  # aws_iam_role.cbs_s3_satellite_bucket_rule will be created
  + resource "aws_iam_role" "cbs_s3_satellite_bucket_rule" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cbs_s3_satellite_bucket_rule"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.security_config will be created
  + resource "aws_iam_role" "security_config" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "config.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "security_config"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.cbs_s3_satellite_bucket_rule_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "cbs_s3_satellite_bucket_rule_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "cbs_s3_satellite_bucket_rule"
    }

  # aws_iam_role_policy_attachment.cbs_s3_satellite_bucket_rule_s3_list_buckets will be created
  + resource "aws_iam_role_policy_attachment" "cbs_s3_satellite_bucket_rule_s3_list_buckets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cbs_s3_satellite_bucket_rule"
    }

  # aws_lambda_function.cbs_s3_satellite_bucket_rule will be created
  + resource "aws_lambda_function" "cbs_s3_satellite_bucket_rule" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/cbs_s3_satellite_bucket_rule.zip"
      + function_name                  = "cbs_s3_satellite_bucket_rule"
      + handler                        = "s3_satellite_bucket_rule.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "HNC8I1xKZrEKlMl41QZ0bhXWpb0Hi5CX/TmN7JxE7vM="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_permission.cbs_s3_satellite_bucket_rule will be created
  + resource "aws_lambda_permission" "cbs_s3_satellite_bucket_rule" {
      + action        = "lambda:InvokeFunction"
      + function_name = (known after apply)
      + id            = (known after apply)
      + principal     = "config.amazonaws.com"
      + statement_id  = "AllowExecutionFromConfig"
    }

Plan: 14 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1,"Program":"tfcmt","SHA1":"","Vars":{}} -->